# vim: set ft=ruby:

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "bash"
brew "zsh"
brew "git"
brew "vim"

# Python
brew "pyenv"
# brew "python3" # for macOS post-Catalina
# Ruby
brew "rbenv"
brew "ruby-build"
# Node
brew "nodenv"
brew "yarn", args: ["without-node"]


# Terminal / shell stuff
cask "alacritty"
brew "tmux"

brew "fzf"
brew "fd"
brew "autojump"
brew "bat"
brew "the_silver_searcher"
brew "watchexec"
brew "hyperfine"

# Rails stuff
brew "mysql"
brew "postgresql"
brew "imagemagick"
brew "vips"

# Other
brew "watchman"
brew "openconnect"

